{
  "PageType": 0,
  "ColumnCount": 38,
  "RowCount": 28,
  "Formulas": {
    "5,16": "IF(出入库类型=5,\"出库日期\",\"入库日期\")",
    "12,26": "SUM(AB18)",
    "0,0": "IF(出入库类型=5,\"出库单\",\"入库单\")",
    "5,37": "IF(AND(OR(库存类型id=1,库存类型id=4,库存类型id=7,库存类型id=8),LEN(其他出入库对象)>0),其他出入库对象,\"\")",
    "17,25": "IF(出入库类型=5,V18,X18)",
    "17,27": "T18*Z18",
    "8,16": "IF(领用人标题=\"领用人\",\"领用部门\",\"联系人\")",
    "16,14": "IF(出入库类型=5,\"出库下限\",\"入库上限\")",
    "6,1": "CONCATENATE(IF(出入库类型=5,\"CK\",\"RK\"),单号)",
    "17,14": "IF(出入库类型=5,M18,K18)",
    "9,1": "IF(OR(库存类型id=1,库存类型id=4,库存类型id=5),供应商_客户名称,其他出入库对象)",
    "5,9": "IF(出入库类型=5,\"出库类型\",\"入库类型\")",
    "17,37": "TEXTJOIN(\",\",\"\",B18)",
    "6,9": "CONCATENATE(分类名称,IF(LEN(内部流转单号)>0,CONCATENATE(\"(\",内部流转单号,\")\"),\"\"))"
  },
  "CustomNames": [
    {
      "Name": "出入库类型",
      "Formula": "出入库_查看和审批!$AL$1"
    },
    {
      "Name": "单号",
      "Formula": "出入库_查看和审批!$AL$7"
    },
    {
      "Name": "供应商_客户名称",
      "Formula": "出入库_查看和审批!$AL$10"
    },
    {
      "Name": "经办人",
      "Formula": "出入库_查看和审批!$AA$7"
    },
    {
      "Name": "库存类型",
      "Formula": "出入库_查看和审批!$J$7"
    },
    {
      "Name": "联系人标题",
      "Formula": "出入库_查看和审批!$Q$9"
    },
    {
      "Name": "联系人或部门",
      "Formula": "出入库_查看和审批!$Q$10"
    },
    {
      "Name": "领用人",
      "Formula": "出入库_查看和审批!$B$10"
    },
    {
      "Name": "领用人标题",
      "Formula": "出入库_查看和审批!$B$9"
    },
    {
      "Name": "全单号",
      "Formula": "出入库_查看和审批!$B$7"
    },
    {
      "Name": "日期",
      "Formula": "出入库_查看和审批!$Q$7"
    },
    {
      "Name": "内部流转单号",
      "Formula": "出入库_查看和审批!$AL$6"
    },
    {
      "Name": "选择的物品id",
      "Formula": "出入库_查看和审批!$AL$18"
    },
    {
      "Name": "总金额",
      "Formula": "出入库_查看和审批!$AA$13"
    },
    {
      "Name": "组件容器",
      "Formula": "出入库_查看和审批!$A$1"
    },
    {
      "Name": "页面容器",
      "Formula": "出入库_查看和审批!$AJ$1"
    },
    {
      "Name": "流程命令条组件",
      "Formula": "出入库_查看和审批!$Z$2"
    },
    {
      "Name": "流程实例id",
      "Formula": "出入库_查看和审批!$AL$12"
    },
    {
      "Name": "审批记录",
      "Formula": "出入库_查看和审批!$AE$2"
    },
    {
      "Name": "comments",
      "Formula": "出入库_查看和审批!$B$13"
    },
    {
      "Name": "contact_number",
      "Formula": "出入库_查看和审批!$AA$10"
    },
    {
      "Name": "分类名称",
      "Formula": "出入库_查看和审批!$AL$5"
    },
    {
      "Name": "审批状态",
      "Formula": "出入库_查看和审批!$D$6"
    },
    {
      "Name": "批量选择物品",
      "Formula": "出入库_查看和审批!$AD$16"
    },
    {
      "Name": "库存类型id",
      "Formula": "出入库_查看和审批!$AL$3"
    },
    {
      "Name": "其他出入库对象",
      "Formula": "出入库_查看和审批!$AL$8"
    },
    {
      "Name": "审批记录可见",
      "Formula": "出入库_查看和审批!$AL$14"
    }
  ]
}