{
  "PageType": 0,
  "ColumnCount": 68,
  "RowCount": 24,
  "Formulas": {
    "10,37": "IF(ISBLANK(AZ11),\"未提交\",IF(ISBLANK(BC11),\"审核中\",IF(BC11=\"拒绝\",\"被拒绝\",\"已审核\")))",
    "9,15": "IF(出入库类型选择器=\"\",\"出入库对象\",IF(出入库类型选择器=5,\"出库对象\",\"入库方\"))",
    "10,15": "IF(OR(AV11=1,AV11=4,AV11=5),IF(ISBLANK(AX11),\"\",AX11),IF(ISBLANK(AR11),\"\",AR11))",
    "9,11": "IF(出入库类型选择器=\"\",\"日期\",IF(出入库类型选择器=5,\"出库日期\",\"入库日期\"))",
    "9,8": "IF(出入库类型选择器=\"\",\"类型\",IF(出入库类型选择器=5,\"出库类型\",\"入库类型\"))"
  },
  "CustomNames": [
    {
      "Name": "查询按钮组件",
      "Formula": "出入库_列表!$AM$4"
    },
    {
      "Name": "出入库类型选择器",
      "Formula": "出入库_列表!$H$8"
    },
    {
      "Name": "分页导航按钮",
      "Formula": "出入库_列表!$C$22"
    },
    {
      "Name": "流程命令条组件",
      "Formula": "出入库_列表!$AK$8"
    },
    {
      "Name": "删除",
      "Formula": "出入库_列表!$AD$8"
    },
    {
      "Name": "添加",
      "Formula": "出入库_列表!$V$8"
    },
    {
      "Name": "修改",
      "Formula": "出入库_列表!$Z$8"
    },
    {
      "Name": "子类型",
      "Formula": "出入库_列表!$L$8"
    },
    {
      "Name": "列表查询框",
      "Formula": "出入库_列表!$C$4"
    },
    {
      "Name": "组件容器2",
      "Formula": "出入库_列表!$C$8"
    },
    {
      "Name": "审批状态查询框",
      "Formula": "出入库_列表!$Y$4"
    },
    {
      "Name": "审批记录",
      "Formula": "出入库_列表!$AO$8"
    }
  ]
}